In [1]:
import numpy as np
import pandas as pd

## 文件操作

In [2]:
data = pd.DataFrame({
    'c1': np.arange(5),
    'c2': list('abcde'),
    'c3': np.linspace(0, 1, 5),
    'c4': ['red', 'yellow', 'blue', 'green', 'black'],
    'c5': np.arange('2021-12-25', '2021-12-30', dtype=np.datetime64)
})
data.to_csv('test.csv', index=False)

data

   c1 c2    c3      c4         c5
0   0  a  0.00     red 2021-12-25
1   1  b  0.25  yellow 2021-12-26
2   2  c  0.50    blue 2021-12-27
3   3  d  0.75   green 2021-12-28
4   4  e  1.00   black 2021-12-29

文件读取

- `pd.read_csv(filepath_or_buffer, sep=',', header='infer', names=None, index_col=None, usecols=None, dtype=None, skiprows=None, nrows=None, parse_dates=False, encoding=None)`
- `pd.read_table(...)`
- `pd.read_excel(io, sheet_name=0, header=0, names=None, index_col=None, usecols=None, dtype=None, skiprows=None, nrows=None, parse_dates=False)`

In [3]:
df = pd.read_csv('test.csv')
df

   c1 c2    c3      c4          c5
0   0  a  0.00     red  2021-12-25
1   1  b  0.25  yellow  2021-12-26
2   2  c  0.50    blue  2021-12-27
3   3  d  0.75   green  2021-12-28
4   4  e  1.00   black  2021-12-29

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      5 non-null      int64
 1   c2      5 non-null      object
 2   c3      5 non-null      float64
 3   c4      5 non-null      object
 4   c5      5 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 328.0+ bytes

In [5]:
# 不将第一行作为表头
pd.read_csv('test.csv', header=None)

    0   1     2       3           4
0  c1  c2    c3      c4          c5
1   0   a   0.0     red  2021-12-25
2   1   b  0.25  yellow  2021-12-26
3   2   c   0.5    blue  2021-12-27
4   3   d  0.75   green  2021-12-28
5   4   e   1.0   black  2021-12-29

In [6]:
# 将某几列作为索引
pd.read_csv('test.csv', index_col=['c1', 'c2'])

         c3      c4          c5
c1 c2
0  a   0.00     red  2021-12-25
1  b   0.25  yellow  2021-12-26
2  c   0.50    blue  2021-12-27
3  d   0.75   green  2021-12-28
4  e   1.00   black  2021-12-29

In [7]:
# 只读取某几列
pd.read_csv('test.csv', usecols=['c1', 'c2'])

   c1 c2
0   0  a
1   1  b
2   2  c
3   3  d
4   4  e

In [8]:
# 解析时间戳
df = pd.read_csv('test.csv', parse_dates=['c5'])
df

   c1 c2    c3      c4         c5
0   0  a  0.00     red 2021-12-25
1   1  b  0.25  yellow 2021-12-26
2   2  c  0.50    blue 2021-12-27
3   3  d  0.75   green 2021-12-28
4   4  e  1.00   black 2021-12-29

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      5 non-null      int64
 1   c2      5 non-null      object
 2   c3      5 non-null      float64
 3   c4      5 non-null      object
 4   c5      5 non-null      datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 328.0+ bytes

In [10]:
# 只读取前几行
pd.read_csv('test.csv', nrows=2)

   c1 c2    c3      c4          c5
0   0  a  0.00     red  2021-12-25
1   1  b  0.25  yellow  2021-12-26

文件写入

- `DataFrame.to_csv(path_or_buf=None, sep=',', na_rep='', float_format=None, columns=None, header=True, index=True, index_label=None, encoding=None, date_format=None)`
- `DataFrame.to_excel(excel_writer, sheet_name='Sheet1', na_rep='', columns=None, header=True, index=True)`
- `DataFrame.to_markdown(buf=None, mode='wt', index=True)`
- `DataFrame.to_latex(header=True, index=True)`

In [11]:
# 不保存索引
df.to_csv('test.csv', index=False)

In [12]:
# 保存为txt
df.to_csv('test.txt', sep='\t', index=False)

In [13]:
# 转为markdown格式
print(df.to_markdown(index=False))

|   c1 | c2   |   c3 | c4     | c5                  |
|-----:|:-----|-----:|:-------|:--------------------|
|    0 | a    | 0    | red    | 2021-12-25 00:00:00 |
|    1 | b    | 0.25 | yellow | 2021-12-26 00:00:00 |
|    2 | c    | 0.5  | blue   | 2021-12-27 00:00:00 |
|    3 | d    | 0.75 | green  | 2021-12-28 00:00:00 |
|    4 | e    | 1    | black  | 2021-12-29 00:00:00 |

In [15]:
# 转为markdown格式
print(df.to_markdown(index=False, tablefmt='grid'))

+------+------+------+--------+---------------------+
|   c1 | c2   |   c3 | c4     | c5                  |
+======+======+======+========+=====================+
|    0 | a    | 0    | red    | 2021-12-25 00:00:00 |
+------+------+------+--------+---------------------+
|    1 | b    | 0.25 | yellow | 2021-12-26 00:00:00 |
+------+------+------+--------+---------------------+
|    2 | c    | 0.5  | blue   | 2021-12-27 00:00:00 |
+------+------+------+--------+---------------------+
|    3 | d    | 0.75 | green  | 2021-12-28 00:00:00 |
+------+------+------+--------+---------------------+
|    4 | e    | 1    | black  | 2021-12-29 00:00:00 |
+------+------+------+--------+---------------------+

In [14]:
# 转为latex格式
print(df.to_latex(index=False))

\begin{tabular}{rlrll}
\toprule
 c1 & c2 &   c3 &     c4 &         c5 \\
\midrule
  0 &  a & 0.00 &    red & 2021-12-25 \\
  1 &  b & 0.25 & yellow & 2021-12-26 \\
  2 &  c & 0.50 &   blue & 2021-12-27 \\
  3 &  d & 0.75 &  green & 2021-12-28 \\
  4 &  e & 1.00 &  black & 2021-12-29 \\
\bottomrule
\end{tabular}

## 数据结构

### Series

一维数据

- `pd.Series(data=None, index=None, dtype=None, name=None, copy=False)`

In [16]:
s = pd.Series(data=[100, 'a', {'dic1': 5}],
              index=pd.Index(['id1', 20, 'third'], name='my_idx'),
              dtype='object',
              name='my_name')
s

my_idx
id1              100
20                 a
third    {'dic1': 5}
Name: my_name, dtype: object

In [17]:
# 数据
s.values

array([100, 'a', {'dic1': 5}], dtype=object)

In [18]:
# 索引
s.index

Index(['id1', 20, 'third'], dtype='object', name='my_idx')

In [19]:
# 类型
s.dtype

dtype('O')

In [20]:
# 名称
s.name

'my_name'

In [21]:
# 大小
s.shape

(3,)

In [25]:
# 利用索引访问数据
s['id1'], s[20], s['third']

(100, 'a', {'dic1': 5})

### DataFrame

多维数据

- `pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=None)`

In [26]:
# 列名与数据分离
df = pd.DataFrame(data=[[1, 'a', 1.2],
                        [2, 'b', 2.2],
                        [3, 'c', 3.2]],
                  index=['row_%d' % i for i in range(3)],
                  columns=['col_%d' % i for i in range(3)])
df

       col_0 col_1  col_2
row_0      1     a    1.2
row_1      2     b    2.2
row_2      3     c    3.2

In [27]:
# 列名映射数据
df = pd.DataFrame(data={'col_0': [1, 2, 3],
                        'col_1': list('abc'),
                        'col_2': [1.2, 2.2, 3.2]},
                  index=['row_%d' % i for i in range(3)])
df

       col_0 col_1  col_2
row_0      1     a    1.2
row_1      2     b    2.2
row_2      3     c    3.2

In [28]:
# 取出某一列
df['col_0']

row_0    1
row_1    2
row_2    3
Name: col_0, dtype: int64

In [29]:
# 取出某几列
df[['col_1', 'col_2']]

      col_1  col_2
row_0     a    1.2
row_1     b    2.2
row_2     c    3.2

In [30]:
# 数据
df.values

array([[1, 'a', 1.2],
       [2, 'b', 2.2],
       [3, 'c', 3.2]], dtype=object)

In [31]:
# 索引
df.index

Index(['row_0', 'row_1', 'row_2'], dtype='object')

In [32]:
# 列名
df.columns

Index(['col_0', 'col_1', 'col_2'], dtype='object')

In [34]:
# 类型
df.dtypes

col_0      int64
col_1     object
col_2    float64
dtype: object

In [35]:
# 形状
df.shape

(3, 3)

In [36]:
# 转置
df.T

      row_0 row_1 row_2
col_0     1     2     3
col_1     a     b     c
col_2   1.2   2.2   3.2

#### 常用函数

In [38]:
df = pd.read_csv('data/learn_pandas.csv')
df = df[df.columns[:7]]

汇总函数

- `DataFrame.head(n=5)`：前n行
- `DataFrame.tail(n=5)`：后n行
- `DataFrame.info(verbose=None, buf=None, max_cols=None)`：信息概况
- `DataFrame.describe(include=None, exclude=None, datetime_is_numeric=False)`：统计量

In [39]:
df.head()

,School,Grade,Name,Gender,Height,Weight,Transfer
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N

In [40]:
df.tail()

,School,Grade,Name,Gender,Height,Weight,Transfer
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   School    200 non-null    object
 1   Grade     200 non-null    object
 2   Name      200 non-null    object
 3   Gender    200 non-null    object
 4   Height    183 non-null    float64
 5   Weight    189 non-null    float64
 6   Transfer  188 non-null    object
dtypes: float64(2), object(5)
memory usage: 11.1+ KB

In [42]:
# 只计算数值型（int, float）数据
df.describe()

           Height      Weight
count  183.000000  189.000000
mean   163.218033   55.015873
std      8.608879   12.824294
min    145.400000   34.000000
25%    157.150000   46.000000
50%    161.900000   51.000000
75%    167.500000   65.000000
max    193.900000   89.000000

统计函数

- `DataFrame.max(axis=None, skipna=None, numeric_only=None)`：最大值
- `DataFrame.min(axis=None, skipna=None, numeric_only=None)`：最小值
- `DataFrame.sum(axis=None, skipna=None, numeric_only=None)`：求和
- `DataFrame.mean(axis=None, skipna=None, numeric_only=None)`：均值
- `DataFrame.median(axis=None, skipna=None, numeric_only=None)`：中位数
- `DataFrame.std(axis=None, skipna=None, numeric_only=None)`：标准差
- `DataFrame.var(axis=None, skipna=None, numeric_only=None)`：方差
- `DataFrame.quantile(q=0.5, axis=0, numeric_only=True)`：分位数
- `DataFrame.idxmax(axis=0, skipna=True)`：最大值对应的索引
- `DataFrame.idxmin(axis=0, skipna=True)`：最小值对应的索引
- `DataFrame.count(axis=0, numeric_only=False)`：非缺失值个数

唯一值函数

- `Series.unique()`：去重
- `DataFrame.nunique(axis=0, dropna=True)`：去重后的数量
- `DataFrame.value_counts(subset=None, normalize=False, sort=True, ascending=False, dropna=True)`：各取值的数量
- `DataFrame.drop_duplicates(subset=None, keep='first', inplace=False)`：舍弃重复行

In [45]:
df['School'].unique()

array(['Shanghai Jiao Tong University', 'Peking University',
       'Fudan University', 'Tsinghua University'], dtype=object)

In [46]:
df['School'].nunique()

4

In [44]:
df['School'].value_counts()

Tsinghua University              69
Shanghai Jiao Tong University    57
Fudan University                 40
Peking University                34
Name: School, dtype: int64

In [70]:
df_demo = df[['Gender', 'Transfer', 'Name']]
df_demo.drop_duplicates(['Gender', 'Transfer'])

    Gender Transfer            Name
0   Female        N    Gaopeng Yang
1     Male        N  Changqiang You
12  Female      NaN        Peng You
21    Male      NaN   Xiaopeng Shen
36    Male        Y    Xiaojuan Qin
43  Female        Y      Gaoli Feng

In [71]:
# 保留最后一次出现的行
df_demo.drop_duplicates(['Gender', 'Transfer'], keep='last')

     Gender Transfer            Name
147    Male      NaN        Juan You
150    Male        Y   Chengpeng You
169  Female        Y   Chengquan Qin
194  Female      NaN     Yanmei Qian
197  Female        N  Chengqiang Chu
199    Male        N     Chunpeng Lv

In [72]:
# 保留只出现一次的行
df_demo.drop_duplicates(['Gender', 'Name'], keep=False)

     Gender Transfer            Name
0    Female        N    Gaopeng Yang
1      Male        N  Changqiang You
2      Male        N         Mei Sun
4      Male        N     Gaojuan You
5    Female        N     Xiaoli Qian
..      ...      ...             ...
194  Female      NaN     Yanmei Qian
196  Female        N         Li Zhao
197  Female        N  Chengqiang Chu
198    Male        N   Chengmei Shen
199    Male        N     Chunpeng Lv

[164 rows x 3 columns]

In [73]:
df['School'].drop_duplicates()

0    Shanghai Jiao Tong University
1                Peking University
3                 Fudan University
5              Tsinghua University
Name: School, dtype: object